app/controllers/species_controller.rb

INSERT INTO "species" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "[\"Arroyo Toad\", \"Endangered\", \"San Diego NWR\"]"], ["created_at", "2019-04-02 22:54:33.635585"], ["updated_at", "2019-04-02 22:54:33.635585"]]
SELECT  "species".* FROM "species" WHERE "species"."name" = $1 AND "species"."status" IS NULL LIMIT $2  [["name", "Arenaria paludicola, Marsh Sandwort"], ["LIMIT", 1]]
INSERT INTO "locations" ("loc", "state", "other_states", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["loc", "San Diego NWR"], ["state", "San Diego NWR"], ["other_states", "CA"], ["created_at", "2019-04-03 22:00:13.407833"], ["updated_at", "2019-04-03 22:00:13.407833"]]
INSERT INTO "species" ("name", "created_at", "updated_at", "location", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Arroyo Toad"], ["created_at", "2019-04-02 23:16:44.427522"], ["updated_at", "2019-04-02 23:16:44.427522"], ["location", "San Diego NWR"], ["status", "Endangered"]]
SELECT  "locations".* FROM "locations" WHERE "locations"."loc" = $1 AND "locations"."state" = $2 AND "locations"."other_states" = $3 LIMIT $4  [["loc", "San Diego NWR"], ["state", "San Diego NWR"], ["other_states", "CA"], ["LIMIT", 1]]
SELECT  "species".* FROM "species" WHERE "species"."name" = $1 AND "species"."status" IS NULL AND "species"."location" = $2 LIMIT $3  [["name", "Arenaria paludicola, Marsh Sandwort"], ["location", "Guadalupe-Nipomo Dunes NWR"], ["LIMIT", 1]]
---
  def index
    # @species = Species.get_enigma_collections
    @species = Species.get_enigma_dataset("f2778fbc-47fd-45e3-a01a-936040650096")
    # @species = Species.all

    # render json: @species

    # @fields = @species['table_rows']['fields']
    # render json: @fields
    @rows = @species['table_rows']['rows']
    @names = @rows.collect {|r| r[1,5]}
    @names.each {|n| Species.find_or_create_by(name: n[0], status: n[1] )}
    @names.each {|n| Location.find_or_create_by(loc: n[2], state: n[3], other_states: n[4])}